//#region Задание #2.2.2.1

// Переменные
var obj = { a: 1, b: 2, c: 3 };

// Вывод:
alert(`
    obj['c'] = ${obj['c']}
    obj.c = ${obj.c}
`);
//#endregion Задание #2.2.2.1

//#region Задание #2.2.2.2

// Переменные
var obj = { Коля: '1000', Вася: '500', Петя: '200' };

// Вывод:
alert(`
    Зарплата Пети: ${obj.Петя}
    Зарплата Коли: ${obj.Коля}
`);
//#endregion Задание #2.2.2.2

//#region Задание #2.2.2.3

// Переменные
var days = {
    1: "Понедельник",
    2: "Вторник",
    3: "Среда",
    4: "Четверг",
    5: "Пятница",
    6: "Суббота",
    7: "Воскресенье",
};

// Вывод:
alert(`
    Текущий день недели: ${days[new Date(Date.now()).getDay()]}
`);
//#endregion Задание #2.2.2.3

//#region Задание #2.2.2.4

// Переменные
var day = 3;

// Вывод:
alert(`
    day = ${day}
    День недели: ${days[day]}
`);
//#endregion Задание #2.2.2.4